Enterprise_Serivces/Prod/Bronze2/CSLAssociationService/CSLClientService/result1/Iteration1/t2_RequestBody.txt

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/03/addressing"><soap:Header><wsa:Action>http://www.gamestop.com/services/csl/client/contracts/2010/05/IClientService/GetClientByClientKey</wsa:Action><wsa:MessageID>uuid:1f73ec5f-c9ac-4afd-8517-ed3a66180356</wsa:MessageID><wsa:ReplyTo><wsa:Address>http://schemas.xmlsoap.org/ws/2004/03/addressing/role/anonymous</wsa:Address></wsa:ReplyTo><wsa:To>http://cslclientserviceqa1.testgs.pvt/ClientService.svc</wsa:To></soap:Header><soap:Body><GetClientByClientKey xmlns="http://www.gamestop.com/services/csl/client/contracts/2010/05"><request><MachineName xmlns="http://www.gamestop.com/services/core/contracts/2010/05">test</MachineName><ClientKey xmlns="http://www.gamestop.com/services/csl/client/contracts/messages/2010/05">[ClientKey]</ClientKey></request></GetClientByClientKey></soap:Body></soap:Envelope>